Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагружаетсяИзИнтернета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаРусском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаУкраинском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Валюты/Ext/ManagerModule.bsl
// Процедура создает элемент справочника Валюты.
//
// Параметры:
//  Код - Число - Код валюты
//  ПараметрыПрописиНаРусском - строка - параметры прописи
//	КлассификаторТаблица - Классификатор валют
//
Процедура СоздатьВалюту(Код, ПараметрыПрописиНаРусском, ПараметрыПрописиНаУкраинском, КлассификаторТаблица)

	СтрокаТаблицы = КлассификаторТаблица.Найти(Код, "Code");
	Если СтрокаТаблицы <> Неопределено Тогда
		
		СправочникСсылка = Справочники.Валюты.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.Валюты.СоздатьЭлемент();
		КонецЕсли;
		
		СправочникОбъект.Код = Код;
		СправочникОбъект.Наименование = СтрокаТаблицы.CodeSymbol;
		СправочникОбъект.НаименованиеПолное = СтрокаТаблицы.Name;
		СправочникОбъект.ЗагружаетсяИзИнтернета = СтрокаТаблицы.RBCLoading;
		СправочникОбъект.ПараметрыПрописиНаРусском = ПараметрыПрописиНаРусском;
		СправочникОбъект.ПараметрыПрописиНаУкраинском = ПараметрыПрописиНаУкраинском;

		Попытка
			СправочникОбъект.Записать();
		Исключение
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры // СоздатьВалюту()

// Процедура заполняет справочник валюты значениями по умолчанию.
//
Процедура ЗаполнитьВалютыПоУмолчанию() Экспорт
	
	КлассификаторXML = Справочники.Валюты.ПолучитьМакет("КлассификаторВалют").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	СоздатьВалюту("980", "гривня, гривни, гривень, ж, копейка, копейки, копеек, ж, 2", "гривня, гривні, гривень, ж, копійка, копійки, копійок, ж, 2", КлассификаторТаблица);
	
КонецПроцедуры // ЗаполнитьВалютыПоУмолчанию()
